PorotokkaServer/app/controllers/posts_controller.rb

  def index
    @post = Post.all
---
SELECT "posts"."id" FROM "posts"

  def create

    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("event_name", "event_date", "event_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_name", "Merge"], ["event_date", "10 July 2018"], ["event_time", "3:00"], ["created_at", "2018-07-09 19:30:01.193657"], ["updated_at", "2018-07-09 19:30:01.193657"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
UPDATE "posts" SET "event_name" = ?, "event_date" = ?, "event_time" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["event_name", "asd"], ["event_date", ""], ["event_time", ""], ["updated_at", "2018-07-18 18:01:52.417376"], ["id", 49]]